[Survived] ArrowFunction
src/App.jsx:9:17
 
 export const ENDPOINT = "http://localhost:4000";
 
-const fetcher = (url) => fetch(`${ENDPOINT}/${url}`).then((r) => r.json());
+const fetcher = () => undefined;
 
 function App() {

[NoCoverage] ArrowFunction
src/App.jsx:9:59
 
 export const ENDPOINT = "http://localhost:4000";
 
-const fetcher = (url) => fetch(`${ENDPOINT}/${url}`).then((r) => r.json());
+const fetcher = (url) => fetch(`${ENDPOINT}/${url}`).then(() => undefined);
 
 function App() {

[NoCoverage] BlockStatement
src/App.jsx:16:37
 	const [editTodo, setEditTodo] = useState(null);
 	const [selectedCategory, setSelectedCategory] = useState("All");
 
-	const markTodoDone = async (id) => {
-		const updatedTodos = data.map((todo) => (todo.id === id ? { ...todo, done: !todo.done } : todo));
-
-		mutate(updatedTodos, false);
-
-		await fetch(`${ENDPOINT}/api/todos/${id}/done`, {
-			method: "PATCH",
-		}).then((r) => r.json());
-
-		mutate();
-	};
+	const markTodoDone = async (id) => {};
 
 	const updateTodo = async (todo) => {

[NoCoverage] ArrowFunction
src/App.jsx:17:33
 	const [selectedCategory, setSelectedCategory] = useState("All");
 
 	const markTodoDone = async (id) => {
-		const updatedTodos = data.map((todo) => (todo.id === id ? { ...todo, done: !todo.done } : todo));
+		const updatedTodos = data.map(() => undefined);
 
 		mutate(updatedTodos, false);

[NoCoverage] EqualityOperator
src/App.jsx:17:44
 	const [selectedCategory, setSelectedCategory] = useState("All");
 
 	const markTodoDone = async (id) => {
-		const updatedTodos = data.map((todo) => (todo.id === id ? { ...todo, done: !todo.done } : todo));
+		const updatedTodos = data.map((todo) => (todo.id !== id ? { ...todo, done: !todo.done } : todo));
 
 		mutate(updatedTodos, false);

[NoCoverage] BooleanLiteral
src/App.jsx:19:24
 	const markTodoDone = async (id) => {
 		const updatedTodos = data.map((todo) => (todo.id === id ? { ...todo, done: !todo.done } : todo));
 
-		mutate(updatedTodos, false);
+		mutate(updatedTodos, true);
 
 		await fetch(`${ENDPOINT}/api/todos/${id}/done`, {

[NoCoverage] ArrowFunction
src/App.jsx:23:11
 
 		await fetch(`${ENDPOINT}/api/todos/${id}/done`, {
 			method: "PATCH",
-		}).then((r) => r.json());
+		}).then(() => undefined);
 
 		mutate();

[NoCoverage] BlockStatement
src/App.jsx:28:37
 		mutate();
 	};
 
-	const updateTodo = async (todo) => {
-		await fetch(`${ENDPOINT}/api/todos/${todo.id}`, {
-			method: "PUT",
-			headers: {
-				"Content-Type": "application/json",
-			},
-			body: JSON.stringify(todo),
-		});
-
-		mutate();
-		setEditTodo(null); // Reset the edit state after saving
-	};
+	const updateTodo = async (todo) => {};
 
 	const deleteTodo = async (id) => {

[NoCoverage] StringLiteral
src/App.jsx:29:15
 	};
 
 	const updateTodo = async (todo) => {
-		await fetch(`${ENDPOINT}/api/todos/${todo.id}`, {
+		await fetch(``, {
 			method: "PUT",
 			headers: {

[Killed] BlockStatement
src/App.jsx:41:35
 		setEditTodo(null); // Reset the edit state after saving
 	};
 
-	const deleteTodo = async (id) => {
-		await fetch(`${ENDPOINT}/api/todos/${id}`, {
-			method: "DELETE",
-		});
-
-		const updatedTodos = data.filter((todo) => todo.id !== id);
-
-		mutate(updatedTodos, false);
-	};
+	const deleteTodo = async (id) => {};
 
 	return (
killedBy: removes a todo when delete button is clicked
statusReason: expected "spy" to be called with arguments: [ …(2) ]

Received: 



Number of calls: 0

[Survived] EqualityOperator
src/App.jsx:46:46
 			method: "DELETE",
 		});
 
-		const updatedTodos = data.filter((todo) => todo.id !== id);
+		const updatedTodos = data.filter((todo) => todo.id === id);
 
 		mutate(updatedTodos, false);

[Survived] ConditionalExpression
src/App.jsx:46:46
 			method: "DELETE",
 		});
 
-		const updatedTodos = data.filter((todo) => todo.id !== id);
+		const updatedTodos = data.filter((todo) => true);
 
 		mutate(updatedTodos, false);

[Survived] StringLiteral
src/App.jsx:59:14
 					<ul className="space-y-2">
 						{data.map((todo) => (
 							<li
-								key={`todo_list__${todo.id}`}
+								key={``}
 								className="p-4 bg-white rounded-md shadow-sm hover:bg-gray-50 flex justify-between items-center"
 							>

[Killed] ConditionalExpression
src/App.jsx:62:10
 								key={`todo_list__${todo.id}`}
 								className="p-4 bg-white rounded-md shadow-sm hover:bg-gray-50 flex justify-between items-center"
 							>
-								{editTodo === todo.id ? (
+								{true ? (
 									<EditTodo todo={todo} onSave={updateTodo} onCancel={() => setEditTodo(null)} />
 								) : (
killedBy: displays a list of todos correctly
statusReason: onCancel is not defined

[Killed] EqualityOperator
src/App.jsx:62:10
 								key={`todo_list__${todo.id}`}
 								className="p-4 bg-white rounded-md shadow-sm hover:bg-gray-50 flex justify-between items-center"
 							>
-								{editTodo === todo.id ? (
+								{editTodo !== todo.id ? (
 									<EditTodo todo={todo} onSave={updateTodo} onCancel={() => setEditTodo(null)} />
 								) : (
killedBy: displays a list of todos correctly
statusReason: onCancel is not defined

[NoCoverage] ArrowFunction
src/App.jsx:63:62
 								className="p-4 bg-white rounded-md shadow-sm hover:bg-gray-50 flex justify-between items-center"
 							>
 								{editTodo === todo.id ? (
-									<EditTodo todo={todo} onSave={updateTodo} onCancel={() => setEditTodo(null)} />
+									<EditTodo todo={todo} onSave={updateTodo} onCancel={() => undefined} />
 								) : (
 									<>

[Survived] ConditionalExpression
src/App.jsx:70:13
 											<span className="block font-bold">{todo.title}</span>
 											<span className="block text-gray-700 mt-1">{todo.body}</span>
 											<span className="block text-gray-500">{todo.category}</span>
-											{todo.deadline && (
-												<span className="block text-gray-500">
-													Deadline: {new Date(todo.deadline).toLocaleDateString()}
-												</span>
-											)}
+											{false}
 										</div>
 

[Survived] LogicalOperator
src/App.jsx:70:13
 											<span className="block font-bold">{todo.title}</span>
 											<span className="block text-gray-700 mt-1">{todo.body}</span>
 											<span className="block text-gray-500">{todo.category}</span>
-											{todo.deadline && (
-												<span className="block text-gray-500">
-													Deadline: {new Date(todo.deadline).toLocaleDateString()}
-												</span>
-											)}
+											{todo.deadline || <span className="block text-gray-500">
+													Deadline: {new Date(todo.deadline).toLocaleDateString()}
+												</span>}
 										</div>
 

[Survived] ArrowFunction
src/App.jsx:78:21
 										</div>
 
 										<button
-											onClick={() => setEditingTodoId(todo.id)}
+											onClick={() => undefined}
 											className="mr-3 bg-yellow-500 text-white rounded-full p-1 hover:bg-yellow-600 focus:outline-none"
 										>

[Survived] ArrowFunction
src/App.jsx:85:21
 										</button>
 
 										<button
-											onClick={() => markTodoDone(todo.id)}
+											onClick={() => undefined}
 											className={`${
 												todo.done ? "bg-green-500" : "bg-red-500"

[Survived] StringLiteral
src/App.jsx:89:42
 											className={`${
 												todo.done ? "bg-green-500" : "bg-red-500"
 											} mr-3 text-white rounded-full p-1 hover:${
-												todo.done ? "bg-green-500" : "bg-red-500"
+												todo.done ? "bg-green-500" : ""
 											} focus:outline-none`}
 										>

[Killed] ArrowFunction
src/App.jsx:97:21
 
 										{/* Delete button */}
 										<button
-											onClick={() => deleteTodo(todo.id)}
+											onClick={() => undefined}
 											className="bg-red-500 text-white rounded-full p-1 hover:bg-red-500 focus:outline-none"
 										>
killedBy: removes a todo when delete button is clicked
statusReason: expected "spy" to be called with arguments: [ …(2) ]

Received: 



Number of calls: 0
