[Survived] BooleanLiteral
src/components/AddTodo.jsx:7:35
 // import { Modal, Group, Button } from "@mantine/core";
 
 function AddTodo({ mutate, data }) {
-	const [open, setOpen] = useState(false);
+	const [open, setOpen] = useState(true);
 	const [formValues, setFormValues] = useState({
 		title: "",

[Survived] StringLiteral
src/components/AddTodo.jsx:9:10
 function AddTodo({ mutate, data }) {
 	const [open, setOpen] = useState(false);
 	const [formValues, setFormValues] = useState({
-		title: "",
+		title: "Stryker was here!",
 		body: "",
 		category: "",

[Survived] StringLiteral
src/components/AddTodo.jsx:10:9
 	const [open, setOpen] = useState(false);
 	const [formValues, setFormValues] = useState({
 		title: "",
-		body: "",
+		body: "Stryker was here!",
 		category: "",
 		// deadline: "",

[Survived] StringLiteral
src/components/AddTodo.jsx:11:13
 	const [formValues, setFormValues] = useState({
 		title: "",
 		body: "",
-		category: "",
+		category: "Stryker was here!",
 		// deadline: "",
 	});

[Killed] BlockStatement
src/components/AddTodo.jsx:15:30
 		// deadline: "",
 	});
 
-	const handleChange = (e) => {
-		setFormValues({
-			...formValues,
-			[e.target.name]: e.target.value,
-		});
-	};
+	const handleChange = (e) => {};
 
 	const createTodo = async () => {
killedBy: updates form input values correctly when user types
statusReason: expected '' to be 'New Todo Title' // Object.is equality

[NoCoverage] BlockStatement
src/components/AddTodo.jsx:22:33
 		});
 	};
 
-	const createTodo = async () => {
-		const newTodo = await fetch(`${ENDPOINT}/api/todos`, {
-			method: "POST",
-			headers: {
-				"Content-Type": "application/json",
-			},
-			body: JSON.stringify(formValues),
-		}).then((r) => r.json());
-
-		mutate([...data, newTodo], false);
-
-		setFormValues({
-			title: "",
-			body: "",
-			category: "",
-			// deadline: "",
-		});
-
-		setOpen(false);
-	};
+	const createTodo = async () => {};
 
 	return (

[NoCoverage] ArrowFunction
src/components/AddTodo.jsx:29:11
 				"Content-Type": "application/json",
 			},
 			body: JSON.stringify(formValues),
-		}).then((r) => r.json());
+		}).then(() => undefined);
 
 		mutate([...data, newTodo], false);

[NoCoverage] BooleanLiteral
src/components/AddTodo.jsx:31:30
 			body: JSON.stringify(formValues),
 		}).then((r) => r.json());
 
-		mutate([...data, newTodo], false);
+		mutate([...data, newTodo], true);
 
 		setFormValues({

[NoCoverage] ArrayDeclaration
src/components/AddTodo.jsx:31:10
 			body: JSON.stringify(formValues),
 		}).then((r) => r.json());
 
-		mutate([...data, newTodo], false);
+		mutate([], false);
 
 		setFormValues({

[NoCoverage] BooleanLiteral
src/components/AddTodo.jsx:40:11
 			// deadline: "",
 		});
 
-		setOpen(false);
+		setOpen(true);
 	};
 

[NoCoverage] BooleanLiteral
src/components/AddTodo.jsx:100:33
 							<div className="flex justify-end">
 								<button
 									type="button"
-									onClick={() => setOpen(false)}
+									onClick={() => setOpen(true)}
 									className="mr-2 bg-gray-300 hover:bg-gray-400 text-gray-700 px-4 py-2 rounded-md"
 								>

[Survived] ArrowFunction
src/components/AddTodo.jsx:100:19
 							<div className="flex justify-end">
 								<button
 									type="button"
-									onClick={() => setOpen(false)}
+									onClick={() => undefined}
 									className="mr-2 bg-gray-300 hover:bg-gray-400 text-gray-700 px-4 py-2 rounded-md"
 								>

[Killed] ArrowFunction
src/components/AddTodo.jsx:116:88
 
 			{/* Button to open modal */}
 			<div className="flex justify-center my-4">
-				<button className="bg-blue-500 text-white font-bold py-2 px-4 rounded-md" onClick={() => setOpen(true)}>
+				<button className="bg-blue-500 text-white font-bold py-2 px-4 rounded-md" onClick={() => undefined}>
 					ADD TODO
 				</button>
killedBy: updates form input values correctly when user types
statusReason: Unable to find an element with the placeholder text of: What is your todo?

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="flex justify-center my-4"
    >

[Killed] BooleanLiteral
src/components/AddTodo.jsx:116:102
 
 			{/* Button to open modal */}
 			<div className="flex justify-center my-4">
-				<button className="bg-blue-500 text-white font-bold py-2 px-4 rounded-md" onClick={() => setOpen(true)}>
+				<button className="bg-blue-500 text-white font-bold py-2 px-4 rounded-md" onClick={() => setOpen(false)}>
 					ADD TODO
 				</button>
killedBy: updates form input values correctly when user types
statusReason: Unable to find an element with the placeholder text of: What is your todo?

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="flex justify-center my-4"
    >
