[NoCoverage] ObjectLiteral
src/components/EditTodo.jsx:5:47
 import { ENDPOINT } from "../App";
 
 function EditTodo({ todo, onSave, mutate }) {
-	const [formValues, setFormValues] = useState({
-		title: todo.title,
-		body: todo.body,
-		category: todo.category,
-		deadline: todo.deadline ? new Date(todo.deadline).toISOString().substring(0, 10) : "",
-	});
+	const [formValues, setFormValues] = useState({});
 
 	const handleChange = (e) => {

[NoCoverage] MethodExpression
src/components/EditTodo.jsx:9:29
 		title: todo.title,
 		body: todo.body,
 		category: todo.category,
-		deadline: todo.deadline ? new Date(todo.deadline).toISOString().substring(0, 10) : "",
+		deadline: todo.deadline ? new Date(todo.deadline).toISOString() : "",
 	});
 

[NoCoverage] BlockStatement
src/components/EditTodo.jsx:19:30
 		});
 	};
 
-	const handleSubmit = (e) => {
-		e.preventDefault();
-		onSave({ ...todo, ...formValues });
-	};
+	const handleSubmit = (e) => {};
 
 	return (

[NoCoverage] ObjectLiteral
src/components/EditTodo.jsx:21:10
 
 	const handleSubmit = (e) => {
 		e.preventDefault();
-		onSave({ ...todo, ...formValues });
+		onSave({});
 	};
 
